esp8266/Arduino/build/linux/work/hardware/tools/avr/lib/avr/include/avr/io58u54a.h
#define ICR3 _SFR_MEM16(0x096)

#define ICR3L _SFR_MEM8(0x096)
#define ICR3L0 0
#define ICR3L1 1
#define ICR3L2 2
#define ICR3L3 3
#define ICR3L4 4
#define ICR3L5 5
#define ICR3L6 6
#define ICR3L7 7

#define ICR3H _SFR_MEM8(0x097)
#define ICR3H0 0
#define ICR3H1 1
#define ICR3H2 2
#define ICR3H3 3
#define ICR3H4 4
#define ICR3H5 5
#define ICR3H6 6
#define ICR3H7 7

#define OCR3A _SFR_MEM16(0x098)

#define OCR3AL _SFR_MEM8(0x098)
#define OCR3AL0 0
#define OCR3AL3 1
#define OCR3AL2 2
#define OCR3AL4 4
#define OCR3AL5 5
#define OCR3AL6 6
#define OCR3AL7 7

#define OCR3AH _SFR_MEM8(0x099)
#define OCR3AH0 0
#define OCR3AH1 1
#define OCR3AH2 2
#define OCR3AH3 3
#define OCR3AH4 4
#define OCR3AH5 5
#define OCR3AH6 6
#define OCR3AH7 7

#define OCR3B _SFR_MEM16(0x09A)

#define OCR3BL _SFR_MEM8(0x09A)
#define OCR3BL0 0
#define OCR3BL1 1
#define OCR3BL2 2
#define OCR3BL3 3
#define OCR3BL4 4
#define OCR3BL5 5
#define OCR3BL6 6
#define OCR3BL7 7

#define OCR3BH _SFR_MEM8(0x09B)
#define OCR3BH0 0
#define OCR3BH1 1
#define OCR3BH2 2
#define OCR3BH3 3
#define OCR3BH4 4
#define OCR3BH5 5
#define OCR3BH6 6
#define OCR3BH7 7

#define TCCR2A _SFR_MEM8(0x0A0)
#define WGM20 0
#define WGM21 1
#define COM2B0 4
#define COM2B1 5
#define COM2A0 6
#define COM2A1 7

#define TCCR2B _SFR_MEM8(0x0A1)
#define CS20 0
#define CS21 1
#define CS22 2
#define WGM22 3
#define FOC2B 6
#define FOC2A 7

#define TCNT2 _SFR_MEM8(0x0A2)
#define TCNT2_0 0
#define TCNT2_1 1
#define TCNT2_2 2
#define TCNT2_3 3
#define TCNT2_4 4
#define TCNT2_5 5
#define TCNT2_6 6
#define TCNT2_7 7

#define OCR2A _SFR_MEM8(0x0A3)
#define OCR2A_0 0
#define OCR2A_1 1
#define OCR2A_2 2
#define OCR2A_3 3
#define OCR2A_4 4
#define OCR2A_5 5
#define OCR2A_6 6
#define OCR2A_7 7

#define OCR2B _SFR_MEM8(0x0A4)
#define OCR2B_0 0
#define OCR2B_1 1
#define OCR2B_2 2
#define OCR2B_3 3
#define OCR2B_4 4
#define OCR2B_5 5
#define OCR2B_6 6
#define OCR2B_7 7

#define TCCR4A _SFR_MEM8(0x0A8)
#define WGM40 0
#define WGM41 1
#define COM4B0 4
#define COM4B1 5
#define COM4A0 6
#define COM4A1 7

#define TCCR4B _SFR_MEM8(0x0A9)
#define CS40 0
#define CS41 1
#define CS42 2
#define WGM42 3
#define FOC4B 6
#define FOC4A 7

#define TCNT4 _SFR_MEM8(0x0AA)
#define TCNT4_0 0
#define TCNT4_1 1
#define TCNT4_2 2
#define TCNT4_3 3
#define TCNT4_4 4
#define TCNT4_5 5
#define TCNT4_6 6
#define TCNT4_7 7

#define OCR4A _SFR_MEM8(0x0AB)
#define OCR4A_0 0
#define OCR4A_1 1
#define OCR4A_2 2
#define OCR4A_3 3
#define OCR4A_4 4
#define OCR4A_5 5
#define OCR4A_6 6
#define OCR4A_7 7

#define OCR4B _SFR_MEM8(0x0AC)
#define OCR4B_0 0
#define OCR4B_1 1
#define OCR4B_2 2
#define OCR4B_3 3
#define OCR4B_4 4
#define OCR4B_5 5
#define OCR4B_6 6
#define OCR4B_7 7

#define TWBR _SFR_MEM8(0x0B8)

#define TWSR _SFR_MEM8(0x0B9)

#define TWAR _SFR_MEM8(0x0BA)

#define TWDR _SFR_MEM8(0x0BB)

#define TWCR _SFR_MEM8(0x0BC)

#define TWAMR _SFR_MEM8(0x0BD)

#define UCSR0A _SFR_MEM8(0x0C0)
#define MPCM0 0
#define U2X0 1
#define UPE0 2
#define DOR0 3
#define FE0 4
#define UDRE0 5
#define TXC0 6
#define RXC0 7

#define UCSR0B _SFR_MEM8(0x0C1)
#define TXB80 0
#define RXB80 1
#define UCSZ02 2
#define TXEN0 3
#define RXEN0 4
#define UDRIE0 5
#define TXCIE0 6
#define RXCIE0 7

#define UCSR0C _SFR_MEM8(0x0C2)
#define UCPOL0 0
#define UCSZ00 1
#define UCSZ01 2
#define USBS0 3
#define UPM00 4
#define UPM01 5
#define UMSEL00 6
#define UMSEL01 7

#define UBRR0 _SFR_MEM16(0x0C4)

#define UBRR0L _SFR_MEM8(0x0C4)
#define UBRR0_0 0
#define UBRR0_1 1
#define UBRR0_2 2
#define UBRR0_3 3
#define UBRR0_4 4
#define UBRR0_5 5
#define UBRR0_6 6
#define UBRR0_7 7

#define UBRR0H _SFR_MEM8(0x0C5)
#define UBRR0_8 0
#define UBRR0_9 1
#define UBRR0_10 2
#define UBRR0_11 3

#define UDR0 _SFR_MEM8(0x0C6)
#define UDR0_0 0
#define UDR0_1 1
#define UDR0_2 2
#define UDR0_3 3
#define UDR0_4 4
#define UDR0_5 5
#define UDR0_6 6
#define UDR0_7 7

#define LCDCRA _SFR_MEM8(0x0E0)
#define LCDBL 0
#define LCDIE 3
#define LCDIF 4
#define LCDAB 6
#define LCDEN 7

#define LCDFRR _SFR_MEM8(0x0E1)
#define LCDCD0 0
#define LCDCD1 1
#define LCDCD2 2
#define LCDPS0 4
#define LCDPS1 5
#define LCDPS2 6
#define LCDPBUFEN 7

#define LCDCCR _SFR_MEM8(0x0E2)
#define LCDCC0 0
#define LCDCC1 1
#define LCDCC2 2
#define LCDCC3 3
#define LCDMDT 4
#define LCDDC0 5
#define LCDDC1 6
#define LCDDC2 7

#define LCDDR0 _SFR_MEM8(0x0E3)
#define SEG000 0
#define SEG001 1
#define SEG002 2
#define SEG003 3
#define SEG004 4
#define SEG005 5
#define SEG006 6
#define SEG007 7

#define LCDDR1 _SFR_MEM8(0x0E4)
#define SEG008 0
#define SEG009 1
#define SEG010 2
#define SEG011 3
#define SEG012 4
#define SEG013 5
#define SEG014 6
#define SEG015 7

#define LCDDR2 _SFR_MEM8(0x0E5)
#define SEG100 0
#define SEG101 1
#define SEG102 2
#define SEG103 3
#define SEG104 4
#define SEG105 5
#define SEG106 6
#define SEG107 7

#define LCDDR3 _SFR_MEM8(0x0E6)
#define SEG108 0
#define SEG109 1
#define SEG024 2
#define SEG111 3
#define SEG112 4
#define SEG113 5
#define SEG114 6
#define SEG115 7

#define LCDDR4 _SFR_MEM8(0x0E7)
#define SEG200 0
#define SEG201 1
#define SEG202 2
#define SEG203 3
#define SEG204 4
#define SEG205 5
#define SEG206 6
#define SEG207 7

#define LCDDR5 _SFR_MEM8(0x0E8)
#define SEG208 0
#define SEG209 1
#define SEG210 2
#define SEG211 3
#define SEG213 5
#define SEG214 6
#define SEG215 7

#define LCDDR6 _SFR_MEM8(0x0E9)
#define SEG300 0
#define SEG301 1
#define SEG302 2
#define SEG303 3
#define SEG304 4
#define SEG305 5
#define SEG306 6
#define SEG307 7

#define LCDDR7 _SFR_MEM8(0x0EA)
#define SEG308 0
#define SEG309 1
#define SEG310 2
#define SEG311 3
#define SEG312 4
#define SEG313 5
#define SEG314 6
#define SEG315 7

#define SC0ICLK _SFR_MEM8(0x100)

#define SC0WT0 _SFR_MEM8(0x101)

#define SC0WT1 _SFR_MEM8(0x102)

#define SC0WT2 _SFR_MEM8(0x103)

#define SC0WT3 _SFR_MEM8(0x104)

#define SC0GT _SFR_MEM16(0x105)

#define SC0GTL _SFR_MEM8(0x105)

#define SC0GTH _SFR_MEM8(0x106)

#define SC0ETU _SFR_MEM16(0x107)

#define SC0ETUL _SFR_MEM8(0x107)

#define SC0ETUH _SFR_MEM8(0x108)

#define SC0IBUF _SFR_MEM8(0x109)

#define SC0SR _SFR_MEM8(0x10A)

