esp8266/Arduino/build/linux/work/hardware/tools/avr/lib/avr/include/avr/io58u54a.h
#define SC0IER _SFR_MEM8(0x10B)

#define SC0IIR _SFR_MEM8(0x10C)

#define SC0ISR _SFR_MEM8(0x10D)

#define SC0CON _SFR_MEM8(0x10E)

#define SC0ICR _SFR_MEM8(0x10F)

#define SC1ICLK _SFR_MEM8(0x110)

#define SC1WT0 _SFR_MEM8(0x111)

#define SC1WT1 _SFR_MEM8(0x112)

#define SC1WT2 _SFR_MEM8(0x113)

#define SC1WT3 _SFR_MEM8(0x114)

#define SC1GT _SFR_MEM16(0x115)

#define SC1GTL _SFR_MEM8(0x115)

#define SC1GTH _SFR_MEM8(0x116)

#define SC1ETU _SFR_MEM16(0x117)

#define SC1ETUL _SFR_MEM8(0x117)

#define SC1ETUH _SFR_MEM8(0x118)

#define SC1IBUF _SFR_MEM8(0x119)

#define SC1SR _SFR_MEM8(0x11A)

#define SC1IER _SFR_MEM8(0x11B)

#define SC1IIR _SFR_MEM8(0x11C)

#define SC1ISR _SFR_MEM8(0x11D)

#define SC1CON _SFR_MEM8(0x11E)

#define SC1ICR _SFR_MEM8(0x11F)

#define SC2ICLK _SFR_MEM8(0x120)

#define SC2WT0 _SFR_MEM8(0x121)

#define SC2WT1 _SFR_MEM8(0x122)

#define SC2WT2 _SFR_MEM8(0x123)

#define SC2WT3 _SFR_MEM8(0x124)

#define SC2GT _SFR_MEM16(0x125)

#define SC2GTL _SFR_MEM8(0x125)

#define SC2GTH _SFR_MEM8(0x126)

#define SC2ETU _SFR_MEM16(0x127)

#define SC2ETUL _SFR_MEM8(0x127)

#define SC2ETUH _SFR_MEM8(0x128)

#define SC2IBUF _SFR_MEM8(0x129)

#define SC2SR _SFR_MEM8(0x12A)

#define SC2IER _SFR_MEM8(0x12B)

#define SC2IIR _SFR_MEM8(0x12C)

#define SC2ISR _SFR_MEM8(0x12D)

#define SC2CON _SFR_MEM8(0x12E)

#define SC2ICR _SFR_MEM8(0x12F)

#define ACLCr _SFR_MEM8(0x140)

#define ACLMr _SFR_MEM8(0x141)

#define ACLIr _SFR_MEM8(0x142)

#define ACLKey1b1r _SFR_MEM8(0x146)

#define ACLKey1b2r _SFR_MEM8(0x147)

#define ACLKey1b3r _SFR_MEM8(0x148)

#define ACLKey1b4r _SFR_MEM8(0x149)

#define ACLKey1b5r _SFR_MEM8(0x14A)

#define ACLKey1b6r _SFR_MEM8(0x14B)

#define ACLKey1b7r _SFR_MEM8(0x14C)

#define ACLKey1b8r _SFR_MEM8(0x14D)

#define ACLKey2b1r _SFR_MEM8(0x14E)

#define ACLKey2b2r _SFR_MEM8(0x14F)

#define ACLKey2b3r _SFR_MEM8(0x150)

#define ACLKey2b4r _SFR_MEM8(0x151)

#define ACLKey2b5r _SFR_MEM8(0x152)

#define ACLKey2b6r _SFR_MEM8(0x153)

#define ACLKey2b7r _SFR_MEM8(0x154)

#define ACLKey2b8r _SFR_MEM8(0x155)

#define ACLIdata1r _SFR_MEM8(0x156)

#define ACLIdata2r _SFR_MEM8(0x157)

#define ACLIdata3r _SFR_MEM8(0x158)

#define ACLIdata4r _SFR_MEM8(0x159)

#define ACLIdata5r _SFR_MEM8(0x15A)

#define ACLIdata6r _SFR_MEM8(0x15B)

#define ACLIdata7r _SFR_MEM8(0x15C)

#define ACLIdata8r _SFR_MEM8(0x15D)

#define ACLOdata1r _SFR_MEM8(0x15E)

#define ACLOdata2r _SFR_MEM8(0x15F)

#define ACLOdata3r _SFR_MEM8(0x160)

#define ACLOdata4r _SFR_MEM8(0x161)

#define ACLOdata5r _SFR_MEM8(0x162)

#define ACLOdata6r _SFR_MEM8(0x163)

#define ACLOdata7r _SFR_MEM8(0x164)

#define ACLOdata8r _SFR_MEM8(0x165)

#define ACLIv1r _SFR_MEM8(0x166)

#define ACLIv2r _SFR_MEM8(0x167)

#define ACLIv3r _SFR_MEM8(0x168)

#define ACLIv4r _SFR_MEM8(0x169)

#define ACLIv5r _SFR_MEM8(0x16A)

#define ACLIv6r _SFR_MEM8(0x16B)

#define ACLIv7r _SFR_MEM8(0x16C)

#define ACLIv8r _SFR_MEM8(0x16D)

#define ACLVr _SFR_MEM8(0x16F)

#define DSRCDvrr _SFR_MEM8(0x180)

#define DSRCDldr _SFR_MEM8(0x181)

#define DSRCDenr _SFR_MEM8(0x182)

#define DSRCIntr _SFR_MEM8(0x188)

#define DSRCInrr _SFR_MEM8(0x189)

#define DSRCItmr _SFR_MEM8(0x18A)

#define DSRCIrmr _SFR_MEM8(0x18B)

#define DSRCItcr _SFR_MEM8(0x18C)

#define DSRCIrcr _SFR_MEM8(0x18D)

#define DSRCTcdrl _SFR_MEM8(0x190)

#define DSRCTcdrh _SFR_MEM8(0x191)

#define DSRCRcdrl _SFR_MEM8(0x192)

#define DSRCRcdrh _SFR_MEM8(0x193)

#define DSRCAder _SFR_MEM8(0x196)

#define DSRCAdsr _SFR_MEM8(0x197)

#define DSRCRadr0 _SFR_MEM8(0x198)

#define DSRCRadr1 _SFR_MEM8(0x199)

#define DSRCRadr2 _SFR_MEM8(0x19A)

#define DSRCRadr3 _SFR_MEM8(0x19B)

#define DSRCPadr0 _SFR_MEM8(0x19C)

#define DSRCPadr1 _SFR_MEM8(0x19D)

#define DSRCPadr2 _SFR_MEM8(0x19E)

#define DSRCPadr3 _SFR_MEM8(0x19F)

#define DSRCPamr0 _SFR_MEM8(0x1A0)

#define DSRCPamr1 _SFR_MEM8(0x1A1)

#define DSRCPamr2 _SFR_MEM8(0x1A2)

#define DSRCPamr3 _SFR_MEM8(0x1A3)

#define DSRCGadr00 _SFR_MEM8(0x1A4)

#define DSRCGadr01 _SFR_MEM8(0x1A5)

#define DSRCGadr02 _SFR_MEM8(0x1A6)

#define DSRCGadr03 _SFR_MEM8(0x1A7)

#define DSRCGamr00 _SFR_MEM8(0x1A8)

#define DSRCGamr01 _SFR_MEM8(0x1A9)

#define DSRCGamr02 _SFR_MEM8(0x1AA)

#define DSRCGamr03 _SFR_MEM8(0x1AB)

#define DSRCGadr10 _SFR_MEM8(0x1AC)

#define DSRCGadr11 _SFR_MEM8(0x1AD)

#define DSRCGadr12 _SFR_MEM8(0x1AE)

#define DSRCGadr13 _SFR_MEM8(0x1AF)

#define DSRCGamr10 _SFR_MEM8(0x1B0)

#define DSRCGamr11 _SFR_MEM8(0x1B1)

#define DSRCGamr12 _SFR_MEM8(0x1B2)

#define DSRCGamr13 _SFR_MEM8(0x1B3)

#define DSRCGadr20 _SFR_MEM8(0x1B4)

#define DSRCGadr21 _SFR_MEM8(0x1B5)

#define DSRCGadr22 _SFR_MEM8(0x1B6)

#define DSRCGadr23 _SFR_MEM8(0x1B7)

#define DSRCGamr20 _SFR_MEM8(0x1B8)

#define DSRCGamr21 _SFR_MEM8(0x1B9)

#define DSRCGamr22 _SFR_MEM8(0x1BA)

#define DSRCGamr23 _SFR_MEM8(0x1BB)

#define DSRCGadr30 _SFR_MEM8(0x1BC)

#define DSRCGadr31 _SFR_MEM8(0x1BD)

#define DSRCGadr32 _SFR_MEM8(0x1BE)

#define DSRCGadr33 _SFR_MEM8(0x1BF)

#define DSRCGamr30 _SFR_MEM8(0x1C0)

#define DSRCGamr31 _SFR_MEM8(0x1C1)

#define DSRCGamr32 _SFR_MEM8(0x1C2)

#define DSRCGamr33 _SFR_MEM8(0x1C3)

#define DSRCBmr0 _SFR_MEM8(0x1C4)

#define DSRCBmr1 _SFR_MEM8(0x1C5)

#define DSRCBmr2 _SFR_MEM8(0x1C6)

#define DSRCBmr3 _SFR_MEM8(0x1C7)

#define DSRCTcmr _SFR_MEM8(0x1C8)

#define DSRCTcnr _SFR_MEM8(0x1C9)

#define DSRCTstr _SFR_MEM8(0x1CA)

#define DSRCTmor _SFR_MEM8(0x1CB)

#define DSRCTrdr _SFR_MEM8(0x1CC)

#define DSRCTflr0 _SFR_MEM8(0x1CD)

#define DSRCTflr1 _SFR_MEM8(0x1CE)

#define DSRCTfsr _SFR_MEM8(0x1CF)

#define DSRCTfir0 _SFR_MEM8(0x1D0)

#define DSRCTfir1 _SFR_MEM8(0x1D1)

#define DSRCTfir2 _SFR_MEM8(0x1D2)

#define DSRCTfir3 _SFR_MEM8(0x1D3)

#define DSRCTprr0 _SFR_MEM8(0x1D4)

#define DSRCTprr1 _SFR_MEM8(0x1D5)

#define DSRCTpor0 _SFR_MEM8(0x1D6)

#define DSRCTpor1 _SFR_MEM8(0x1D7)

#define DSRCPplr _SFR_MEM8(0x1D8)

#define DSRCRcmr _SFR_MEM8(0x1E0)

#define DSRCRcnr _SFR_MEM8(0x1E1)

#define DSRCRstr _SFR_MEM8(0x1E2)

#define DSRCRflr0 _SFR_MEM8(0x1E3)

#define DSRCRflr1 _SFR_MEM8(0x1E4)

#define DSRCRdtr _SFR_MEM8(0x1E5)

