esp8266/Arduino/build/linux/work/hardware/tools/avr/lib/avr/include/avr/io58u54a.h
#define DSRCRrdr _SFR_MEM8(0x1E6)

#define DSRCRfir0 _SFR_MEM8(0x1E8)

#define DSRCRfir1 _SFR_MEM8(0x1E9)

#define DSRCRfir2 _SFR_MEM8(0x1EA)

#define DSRCRfir3 _SFR_MEM8(0x1EB)

#define DSRCRfcr0 _SFR_MEM8(0x1EC)

#define DSRCRfcr1 _SFR_MEM8(0x1ED)

#define DSRCRfcr2 _SFR_MEM8(0x1EE)

#define DSRCRfcr3 _SFR_MEM8(0x1EF)

#define DSRCTestr _SFR_MEM8(0x1F0)

#define DSRCFstr _SFR_MEM8(0x1F4)

#define DSRCTfcr _SFR_MEM8(0x1F5)

#define DSRCRfcr _SFR_MEM8(0x1F6)

#define DSRCDtdf _SFR_MEM8(0x1F7)

#define DSRCDrdf _SFR_MEM8(0x1F8)


/* Interrupt vectors */
/* Vector 0 is the reset vector */
#define PCINT0_vect_num  1
#define PCINT0_vect      _VECTOR(1)  /* Pin Change Interrupt Request 0 PortA */
#define PCINT1_vect_num  2
#define PCINT1_vect      _VECTOR(2)  /* Pin Change Interrupt Request 1 PortB */
#define PCINT2_vect_num  3
#define PCINT2_vect      _VECTOR(3)  /* Pin Change Interrupt Request 2 PortC */
#define PCINT3_vect_num  4
#define PCINT3_vect      _VECTOR(4)  /* Pin Change Interrupt Request 3 PortD-LCD */
#define PCINT4_vect_num  5
#define PCINT4_vect      _VECTOR(5)  /* Pin Change Interrupt Request 4 PortE-LCD */
#define PCINT5_vect_num  6
#define PCINT5_vect      _VECTOR(6)  /* Pin Change Interrupt Request 5 PortF-LCD */
#define WDT_vect_num  7
#define WDT_vect      _VECTOR(7)  /* Watchdog Time out Interrupt */
#define TIMER4_COMPA_vect_num  8
#define TIMER4_COMPA_vect      _VECTOR(8)  /* Timer 8bit /Counter4 Compare Match A */
#define TIMER4_COMPB_vect_num  9
#define TIMER4_COMPB_vect      _VECTOR(9)  /* Timer 8bit /Counter4 Compare Match B */
#define TIMER4_OVF_vect_num  10
#define TIMER4_OVF_vect      _VECTOR(10)  /* Timer/Counter4 Overflow */
#define TIMER3_INPUT_CAPT_vect_num  11
#define TIMER3_INPUT_CAPT_vect      _VECTOR(11)  /* Timer 16bit/Counter3 Capture Event */
#define TIMER3_COMPA_vect_num  12
#define TIMER3_COMPA_vect      _VECTOR(12)  /* Timer 16bit/Counter3 Compare Match A */
#define TIMER3_COMPB_vect_num  13
#define TIMER3_COMPB_vect      _VECTOR(13)  /* Timer 16bit/Counter3 Compare Match B */
#define TIMER3_OVF_vect_num  14
#define TIMER3_OVF_vect      _VECTOR(14)  /* Timer3 16 bit/Counter3 Overflow */
#define TIMER2_COMPA_vect_num  15
#define TIMER2_COMPA_vect      _VECTOR(15)  /* Timer 8bit/Counter2 Compare Match A */
#define TIMER2_COMPB_vect_num  16
#define TIMER2_COMPB_vect      _VECTOR(16)  /* Timer 8bit/Counter2 Compare Match B */
#define TIMER2_OVF_vect_num  17
#define TIMER2_OVF_vect      _VECTOR(17)  /* Timer2 8 bit/Counter2 Overflow */
#define TIMER1_INPUT_CAPT_vect_num  18
#define TIMER1_INPUT_CAPT_vect      _VECTOR(18)  /* Timer1 16bit/Counter1 Capture Event */
#define TIMER1_COMPA_vect_num  19
#define TIMER1_COMPA_vect      _VECTOR(19)  /* Timer 16bit/Counter1 Compare Match A */
#define TIMER1_COMPB_vect_num  20
#define TIMER1_COMPB_vect      _VECTOR(20)  /* Timer 16bit/Counter1 Compare Match B */
#define TIMER1_OVF_vect_num  21
#define TIMER1_OVF_vect      _VECTOR(21)  /* Timer1 16 bit/Counter1 Overflow */
#define TIMER0_COMP_A_vect_num  22
#define TIMER0_COMP_A_vect      _VECTOR(22)  /* Timer0/Counter0 Compare Match */
#define TIMER0_COMP_B_vect_num  23
#define TIMER0_COMP_B_vect      _VECTOR(23)  /* Timer0 8bit /Counter0 Compare Match A */
#define TIMER0_OVF_vect_num  24
#define TIMER0_OVF_vect      _VECTOR(24)  /* Timer0 8bit/Counter0 Overflow */
#define IRQ_DSRC_vect_num  25
#define IRQ_DSRC_vect      _VECTOR(25)  /* DSRC interrupt - custom IP */
#define IRQ_SCI0_vect_num  26
#define IRQ_SCI0_vect      _VECTOR(26)  /* Smart Card 0 interrupt */
#define IRQ_SCI1_vect_num  27
#define IRQ_SCI1_vect      _VECTOR(27)  /* Smart Card 1 interrupt */
#define IRQ_SCI2_vect_num  28
#define IRQ_SCI2_vect      _VECTOR(28)  /* Smart Card 2 interrupt */
#define IRQ_CL_vect_num  29
#define IRQ_CL_vect      _VECTOR(29)  /* AWAH custom IP interrupt */
#define SPI_STC_vect_num  30
#define SPI_STC_vect      _VECTOR(30)  /* SPI Serial Transfer Complete */
#define USART0_RX_vect_num  31
#define USART0_RX_vect      _VECTOR(31)  /* USART0, Rx Complete */
#define USART0_UDRE_vect_num  32
#define USART0_UDRE_vect      _VECTOR(32)  /* USART0 Data register Empty */
#define USART0_TX_vect_num  33
#define USART0_TX_vect      _VECTOR(33)  /* USART0, Tx Complete */
#define TWI_vect_num  34
#define TWI_vect      _VECTOR(34)  /* 2 wire interface */
#define SPM_READY_vect_num  35
#define SPM_READY_vect      _VECTOR(35)  /* Store Program Memory Read */
#define LCD_vect_num  36
#define LCD_vect      _VECTOR(36)  /* LCD Start of Frame */
#define BOD_SMHIGH_vect_num  37
#define BOD_SMHIGH_vect      _VECTOR(37)  /* SM High level - SWVBAT between 2V to 2.2V */

#define _VECTOR_SIZE 4 /* Size of individual vector. */
#define _VECTORS_SIZE (38 * _VECTOR_SIZE)


/* Constants */
#define SPM_PAGESIZE (256)
#define RAMSTART     (0x200)
#define RAMSIZE      (8192)
#define RAMEND       (RAMSTART + RAMSIZE - 1)
#define XRAMSTART    (NA)
#define XRAMSIZE     (0)
#define XRAMEND      (RAMEND)
#define E2END        (0x0)
#define E2PAGESIZE   (0)
#define FLASHEND     (0xFFFF)


/* Fuses */
#define FUSE_MEMORY_SIZE 1

/* Fuse Byte */
#define FUSE_BOOTRST  (unsigned char)~_BV(0)  /* Select Reset Vector */
#define FUSE_BOOTSZ0  (unsigned char)~_BV(1)  /* Select Boot Size */
#define FUSE_BOOTSZ1  (unsigned char)~_BV(2)  /* Select Boot Size */
#define FUSE_SMHIGH  (unsigned char)~_BV(3)  /* SM SWVBAT not activated by default */
#define FUSE_WDTON  (unsigned char)~_BV(4)  /* Watchdog timer always on */
#define FUSE_CKSEL0  (unsigned char)~_BV(5)  /* Select Clock Source */
#define FUSE_SUT  (unsigned char)~_BV(6)  /* Select start-up time */
#define FUSE_OCDEN  (unsigned char)~_BV(7)  /* Enable OCD */
#define FUSE_DEFAULT (FUSE_BOOTSZ1 & FUSE_BOOTSZ0)


/* Lock Bits */
#define __LOCK_BITS_EXIST
#define __BOOT_LOCK_BITS_0_EXIST
#define __BOOT_LOCK_BITS_1_EXIST


/* Signature */
#define SIGNATURE_0 0x0
#define SIGNATURE_1 0x0
#define SIGNATURE_2 0x0


#endif /* _AVR_58U54A_Albatross_H_ */

